[GWT_Ability_Suppression]
SuppressionTargetEffectDesc="Suppressed! Suffering <WeaponBasedSuppression:PENALTY/> penalty to aim, and will be shot if attempting to move."
SuppressionSourceEffectDesc="Currently suppressing a target."

[Suppression X2AbilityTemplate]
LocFriendlyName="Suppression"
LocLongDescription="Fire a barrage that pins down a target, granting reaction fire against it if it moves, and imposing a <WeaponBasedSuppression:PENALTY/> penalty to the target's aim."
LocHelpText="Penalize target's aim and shoot them if they move. <WeaponBasedSuppression:COST/> <WeaponBasedSuppression:PENALTY/>"
LocFlyOverText="Suppression"
LocPromotionPopupText="<Bullet/> Suppression costs <WeaponBasedSuppression:COST/> ammo points to use, but has no cooldown.<br/><Bullet/> Suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> If multiple units suppress a target, the aim penalty will stack.<br/>"